{
    "pageHeroButtonText": "History",
    "historyOfOriginTitle": "Team's history of origin",
    "subtitle": "History",
    "historyOfOriginTextFirstPart": "No state or municipal institution in Ukraine specializes in the rescue of wild, homeless, or domestic animals in life-threatening situations. Therefore, these tasks fall on the shoulders of volunteers with the necessary skills and equipment. In Kyiv, since 2014, the Animal Rescue Team, or Kyiv Animal Rescue Group (KARG), has been operating as a public organization that, during its activities, has saved over 10 thousand living beings.",
    "historyOfOriginTextSecondPart": "In the village of Ploske, near Kyiv, a cat ended up in the ventilation shaft of a building. After receiving a call from the owner of the animal, a rescue team is dispatched to the task. Three people, dressed in special work suits, ascend to the attic. Initially, they take two measurements: one indicates the distance from the ventilation to the end wall of the building, and the other indicates the height where the cat is stuck. Afterward, they drill the tiled wall of the bathroom (closest to where the animal is) with a perforator. Peering through, a pair of startled cat eyes is visible. Finally, only a little remains: to break off a few more centimeters of cement and extract the animal.",
    "historyOfOriginTextThirdPart": "This is how KARG operates—a structure that began with the personal initiative of two volunteers, Mykhailo Storozhuk and Liubov Kravchuk—and transformed into a public organization that takes care of animal rescue. It has four rescue vehicles and one fire truck at its disposal, and the organization itself consists of over twenty people. Every day, the Rescue Team's hotline receives calls, usually from Kyiv residents seeking help, but also from people in the suburbs, and sometimes even from other regions of the country. Because today, it is extremely difficult to find an organization whose members not only possess specific animal rescue skills but also agree to do it for a small fee, and sometimes even for free.",
    "needInfoTitle": "Need help?",
    "needInfoSubtitle": "Before reaching out to us, please review our list of services and our contact guidelines.",
    "needInfoButtonCaption": "Contact protocol", 
    "historyOfOriginButtonText": "About the team"
}