{
    "pseudoButtonText": "Our team",
    "subtitle": "Our team",
    "quote": "— We are a team of caring volunteers, rescuing animals in distress.",
    "signature": "The founders of KARG are Mykhailo and Liubov.",
    "teamEquipmentTextFirstPar": "KARG operates with four rescue vehicles and one fire truck, supported by a team of over twenty individuals including rescuers, drivers, dispatchers, programmers, mechanical engineers, a garage supervisor, accountant, and legal consultant.",
    "teamEquipmentTextSecondPar": "The team members are either professional climbers, speleologists (cave explorers), or diggers (explorers of underground passages), thus they can reach animals from virtually any location.",
    "teamEquipmentTextThirdPar": "In addition, there is a motorboat and equipment for water operations available. In case of forest fires, the team utilizes a fire truck for extinguishing forest fires and a group of 10 volunteers who are not members of the rescue team.",
    "volontiersText": "Until now, the ranks of the Rescue Team have occasionally been replenished with new volunteers. To become a KARG rescuer, one must undergo training. However, many people join the team for a short period, and later they leave and do not return. There have been challenging periods in the organization when one person could perform several roles simultaneously and work for 4-5 shifts in a row. Despite this, throughout its existence, the Rescue Team has never suspended its operations. And volunteers who manage to stay in the organization for more than a month tend to stay here for a long time.",
    "donatesText": "The number of calls for help increases every day, but the number of paid missions does not grow: only a third of applicants are willing to pay for the service. There is no possibility of stable financial support. As a result, rescuers express their gratitude to donors, whose contributions provide more animals with a chance at life.",
    "donationBlock": "Contributions can be made through payment systems:",
    "partnersTitle": "Partners" 
}