import styles from "../styles/helpSideBar.module.scss"

export default function AdviceTab() {
    return (
        <div>
            <article>
                <div className={styles.pageTitle}>
                    <h2>Поради</h2>
                </div>
                <div className={styles.pageContent}>
                    <ol>
                        <li>
                            У вкладці "Поради" ви можете додавати, змінювати та видаляти картки (блоки) з порадами.
                        </li>
                        <li>
                            Щоб додати картку з порадою, потрібно натиснути на кнопку "Створити статтю" праворуч.
                        </li>
                        <li>
                            Натискаючи кнопку "Створити статтю", поверх панелі відкривається вікно "Додати статтю".
                            Вікно має дві вкладки відповідно до мов, якими вноситься інформація: українська (ліворуч)
                            та англійська (праворуч).
                        </li>
                        <li>
                            Нижче назви мови є строка для введення заголовку статті.
                        </li>
                        <li>
                            Нижче розташований блок, куди додається текст статті.
                        </li>
                        <li>
                            Нижче розташований плюсик, на який ви повинні натиснути, щоб додати фото
                            (при натисканні відкривається файловий провідник, де можна обрати фото).
                            Фото також можна додавати перетягуванням файлу на плюсик
                            <em>(формат: jpg, png, максимальна кількість фото — 1 шт., максимальний розмір — 1 МБ).</em>
                        </li>
                        <li>
                            Нижче місця, де додаються фото, розміщено дві кнопки:
                            ліворуч біла з написом "Скасувати" та праворуч помаранчева з написом "Опублікувати".
                        </li>
                        <li>
                            Після натискання кнопки "Опублікувати" стаття з’явиться на сайті.
                        </li>
                        <li>
                            Нижче заголовків розміщується список статей. На сторінці відображається 6 статей.
                            Якщо у базі даних більше ніж 6 статей, сайт створює додаткові сторінки у необхідній кількості.
                        </li>
                        <li>
                            Щоб видалити статтю, вам потрібно натиснути на смітничок (видалення відбувається з бази даних та з сайту).
                            При натисканні з'являється віконце, яке питає, чи ви впевнені у своєму рішенні, та повідомляє,
                            що цю дію не можна буде скасувати. У віконці є дві кнопки:
                            "Скасувати" — вікно зникає, "Видалити" — стаття буде видалена назавжди.
                        </li>
                        <li>
                            Щоб редагувати статтю, вам потрібно натиснути на олівець, після чого відкривається вікно "Редагувати статтю".
                            Тут ви можете внести зміни до будь-якої інформації, що міститься у віконцях, та замінити фото.
                        </li>
                    </ol>
                </div>
            </article>
        </div>
    );

}