import styles from "../styles/helpSideBar.module.scss"

export default function ContactTab() {
    return (
        <div>
            <article>
                <div className={styles.pageTitle}>
                    <h2>Контакти та статистичні дані</h2>
                </div>
                <div className={styles.pageContent}>
                    <ol>
                        <li>
                            Сторінка "Контакти та статистичні дані" дає вам можливість змінювати номери телефонів,
                            адресу, адресу електронної пошти, посилання на сторінки соцмереж, а також статистичні дані,
                            що розміщені на головній сторінці сайту.
                        </li>
                        <li>
                            Нижче назви сторінки розміщуються строки з контактами та даними.
                        </li>
                        <li>
                            <strong>Створення додаткових строк не передбачається.</strong>
                        </li>
                        <li>
                            <strong>Видалення строк з контактами чи даними не передбачається. </strong>
                            Значок кошика не активний.
                        </li>
                        <li>
                            Для внесення змін до даних потрібно натиснути значок олівця.
                        </li>
                        <li>
                            При натисканні олівця поверх панелі керування з'являється вікно "Редагувати дані".
                        </li>
                        <li>
                            Вікно містить строку з видом даних, у якій розміщено сам вид даних. Інформація в цій
                            строчці не редагується.
                        </li>
                        <li>
                            Нижче розміщується вікно з самими даними, які можна змінювати.
                        </li>
                        <li>
                            При натисканні на олівець у строчці, де розміщена Адреса, дані потрібно вносити у два
                            поля — відповідно українською та англійською мовами.
                        </li>
                        <li>
                            Після того як зміни було внесено, їх необхідно зберегти, натиснувши відповідну кнопку.
                        </li>
                    </ol>
                </div>
            </article>
        </div>
    );
}