import styles from "../styles/helpSideBar.module.scss"

export default function FAQTab() {
    return (
        <div>
            <article>
                <div className={styles.pageTitle}>
                    <h2>FAQ</h2>
                </div>
                <div className={styles.pageContent}>
                    <ol>
                        <li>
                            На вкладці "FAQ" ви можете додавати питання, а також видаляти та редагувати їх.
                        </li>
                        <li>
                            Щоб додати питання до переліку, вам потрібно натиснути кнопку "Додати питання",
                            і поверх панелі відкриється вікно "Додати питання".
                            Вікно має дві вкладки відповідно до мов, на яких вноситься інформація:
                            українська (ліворуч) та англійська (праворуч).
                        </li>
                        <li>
                            Нижче назви мови є строка для введення питання.
                            Валідація: звичайний текст українською чи англійською мовами. Так як поле пердбачено
                            для запитання, <strong>знак "?" додається в кінці автоматично.</strong>
                        </li>
                        <li>
                            Нижче строки для введення питання розташований блок,
                            куди додається відповідь на питання.
                        </li>
                        <li>
                            Нижче розміщується список питань та відповідей.
                            На сторінці відображається 10 питань. Якщо їх більше ніж 10,
                            сайт створює нові сторінки.
                        </li>
                        <li>
                            Щоб редагувати питання та відповіді, вам потрібно натиснути на олівець.
                            Як результат, відкриється вікно "Редагувати питання".
                            Тут ви можете внести зміни до будь-якої інформації, що міститься у віконцях.
                        </li>
                        <li>
                            Щоб видалити питання з переліку, вам потрібно натиснути на значок кошика.
                            Видалення відбувається з бази даних, переліку та сайту безповоротно.
                        </li>
                    </ol>
                </div>
            </article>
        </div>
    );
}