import styles from "../styles/helpSideBar.module.scss"

export default function GeneralTab() {
    return (
        <div>
            <article>
                <div className={styles.pageTitle}>
                    <h2>Загальні питання</h2>
                </div>
                <div className={styles.pageContent}>
                    <ol>
                        <li>
                            Панель керування відображається тільки українською мовою.
                        </li>
                        <li>
                            Існує 2 види користувачів: суперадмін та адміни.
                        </li>
                        <li>
                            Користувачі мають однакові повноваження щодо редагування інформації в базі даних.
                        </li>
                        <li>
                            Тільки суперадмін може додавати та видаляти адмінів до панелі керування.
                        </li>
                        <li>
                            За загальним правилом зберегти новостворену картку з твариною, порадою чи звітом можна тільки,
                            коли заповнені всі поля українською та англійською мовами та додано хоча би одне фото. Якщо
                            ця умова не виконана, кнопка «Зберегти» не активується — не змінює колір на помаранчевий.
                        </li>
                        <li>
                            Фото не є обов’язковим тільки у вкладці Мій акаунт.
                        </li>
                        <li>
                            Всі поля для вводу даних мають обмеження на кількість символів, які можна ввести.
                            Для полів типа "імя" та "питання"- обмеження до 500 символів, для полів типу
                            "стаття" - до 10000 символів.
                        </li>
                    </ol>
                </div>
            </article>
        </div>
    )
}