import styles from "../styles/helpSideBar.module.scss"

export default function MyAccountTab() {
    return (
        <div>
            <article>
                <div className={styles.pageTitle}>
                    <h2>У вкладці "Мій акаунт" член команди може редагувати інформацію про себе.</h2>
                </div>
                <div className={styles.pageContent}>
                    <ol>
                        <li>Вкладка "Мій акаунт" є першою згори в Налаштуваннях панелі керування.</li>
                        <li>
                            Відкриваючи вкладку "Мій акаунт", ви бачите панель, де можете додати своє фото,
                            якщо фото ще не додано. Замість зображення в кружечку є плюсик, натиснення на який
                            викликає провідник, де ви можете обрати зображення.
                        </li>
                        <li>
                            Якщо фото вже додано, ви можете його видалити, натиснувши на кошик, і додати нове.
                            Або можете не додавати фото. Тоді кружечок залишиться пустим.
                        </li>
                        <li>Нижче панелі із зображенням розміщується "Персональна інформація".</li>
                        <li>Нижче ліворуч — строка для вказання Імені, праворуч — для вказання Прізвища.</li>
                        <li>Нижче ліворуч — строка для вказання Контактного номера телефону, праворуч — E-mail.</li>
                        <li>
                            Нижче праворуч знаходиться кнопка "Зберегти зміни".
                            Вона активується після того, як до вище вказаних строк вноситься нова інформація.
                        </li>
                        <li>Строка з E-mail не підлягає редагуванню в цій вкладці.</li>
                    </ol>
                </div>
            </article>
        </div>
    );
}