import styles from "../styles/helpSideBar.module.scss"

export default function PartnersTab() {
    return (
        <div>
            <article>
                <div className={styles.pageTitle}>
                    <h2>
                        Партнери
                    </h2>
                </div>
                <div className={styles.pageContent}>
                    <ol>
                        <li>
                            У вкладці "Партнери" ви можете додавати, видаляти та редагувати партнерів,
                            що знаходяться на сторінці Наша команда, та, відповідно, в базі даних.
                        </li>
                        <li>
                            Щоб додати партнера на сайт та до бази даних потрібно натиснути на кнопку
                            Додати партнера, що знаходиться у правому верхньому кутку вкладки.
                        </li>
                        <li>
                            Після натискання кнопки Додати партнера поверх панелі відкривається вікно
                            Додати партнера, до якого потрібно внести інформацію про партнера.
                        </li>
                        <li>
                            Вікно Додати партнера має зверху строку, де зазначається назва компанії партнера.
                        </li>
                        <li>
                            Нижче назви компанії партнера є місце, де розміщується зображення лого партнера.
                            (можна додати тільки 1 фото)
                        </li>
                        <li>
                            Щоб логотип партнера мав єдиний фіолетовий фон на сайті, його потрібно завантажити у
                            форматі PNG із прозорим фоном. Якщо логотип буде у форматі JPG або матиме білий фон,
                            він не поєднається з загальним дизайном сайту.
                            <br />
                            <strong>Формат файлу:</strong> PNG
                            <br />
                            <strong>Фон:</strong> прозорий
                            <br />
                            <strong>Якщо у логотипа є фон, він не зміниться на фіолетовий автоматично.</strong>
                        </li>
                        <li>
                            Нижче знаходиться строка, куди власник додає посилання на сайт партнера, яке
                            прикріплюється до лого на сайті.
                        </li>
                        <li>
                            Кнопка Зберегти активується при заповнені усіх строк та додавання зображення.
                        </li>
                        <li>
                            Після збереження партнер додається до бази даних, та розміщується на сайті та у
                            списку партнерів у вкладці Партнери в Панелі керування.
                        </li>
                        <li>
                            Для того щоб видалити партнера потрібно натиснути на значок кошику, що знаходиться
                            в строці відповідного партнера.
                        </li>
                        <li>
                            Значок олівець дає можливість редагувати інформацію про партнера. При натисканні на
                            олівець, з'являється вікно Редагувати партнера, де ви можете редагувати інформацію
                            про конкретного партнера, а також замінити зображення лого.
                        </li>
                        <li>
                            На сторінці розміщується інформація про 6 партнерів. Якщо у базі даних більше ніж
                            6 партнерів, то сайт створює додаткові сторінки у необхідній кількості.
                        </li>
                    </ol>
                </div>
            </article >
        </div >
    )
}