import styles from "../styles/helpSideBar.module.scss"

export default function PartnersTab() {
    return (
        <div>
            <article>
                <div className={styles.pageTitle}>
                    <h2>
                        У вкладці Партнери ви можете додавати, видаляти та редагувати партнерів,
                        що знаходяться на сторінці Наша команда, та, відповідно, в базі даних.
                    </h2>
                </div>
                <div className={styles.pageContent}>
                    <ol>
                        <li>
                            Щоб додати партнера на сайт та до бази даних потрібно натиснути на кнопку
                            Додати партнера, що знаходиться у правому верхньому кутку вкладки.
                        </li>
                        <li>
                            Після натискання кнопки Додати партнера поверх панелі відкривається вікно
                            Додати партнера, до якого потрібно внести інформацію про партнера.
                        </li>
                        <li>
                            Вікно Додати партнера має зверху строку, де зазначається назва компанії партнера.
                        </li>
                        <li>
                            Нижче назви компанії партнера є місце, де розміщується зображення лого партнера.
                            (можна додати тільки 1 фото)
                        </li>
                        <li>
                            Нижче знаходиться строка, куди власник додає посилання на сайт партнера, яке
                            прикріплюється до лого на сайті.
                        </li>
                        <li>
                            Кнопка Зберегти активується при заповнені усіх строк та додавання зображення.
                        </li>
                        <li>
                            Після збереження партнер додається до бази даних, та розміщується на сайті та у
                            списку партнерів у вкладці Партнери в Панелі керування.
                        </li>
                        <li>
                            Для того щоб видалити партнера потрібно натиснути на значек кошику, що знаходиться
                            в строці відповідного партнера.
                        </li>
                        <li>
                            Значек олівець дає можливість редагувати інформацію про партнера. При натисканні на
                            олівець з'являється вікно Редагувати партнера де ви можете редагувати інформмацію
                            про конкретного партнера, а також замінити зображення лого.
                        </li>
                        <li>
                            На сторінці розміщується інформація про 10 партнерів. Якщо у базі данних більше ніж
                            10 партнерів, то сайт створює додаткові сторінки у необхідній кількості.
                        </li>
                    </ol>
                </div>
            </article>
        </div>
    )
}