import styles from "../styles/helpSideBar.module.scss"

export default function PetsTab() {
    return (
        <div>
            <article>
                <div className={styles.pageTitle}>
                    <h2>У вкладці Тварини ви можете додавати, видаляти та вносити зміни до карток тварин,
                        що розміщуються на сайті на сторінці Наші тварини та, відповідно у базі даних.
                    </h2>
                </div>
                <div className={styles.pageContent}>
                    <ol>
                        <li>
                            Щоб додати картку тварини потрібно натиснути на кнопку Додати тварину,
                            що знаходиться у верхньому правому кутку вкладки.
                        </li>
                        <li>
                            Після натискання кнопки Додати тварину поверх панелі відкривається вікно Додати тварину.
                            Вікно має дві вкладки відповідно до мов, на яких вносяться дані про тварину:
                            українська(ліворуч) та англійська(праворуч). Важливо: для збереження картки
                            інформація повинна бути внесена обома мовами.
                        </li>
                        <li>
                            Додайте ім’я тварини у строку для введення Імені тварини.
                        </li>
                        <li>
                            Додайте фото тварини натиснувши на плюсик під строкою для введення Імені тварини.
                            При натисканні відкриється файловий провідник, де можна обрати фото. Фото також можна
                            додавати перетягуванням фото на плюсик (максимальна кількість фото які можна додати: 4 шт.,
                            максимальний розмір одного фото: 500 КБ)
                        </li>
                        <li>
                            Нижче фото розміщується вікно для вибору категорії тварини.  Виберіть категорію.
                            Всього передбачено 3 категорії: кіт, собака, інші тварини.
                        </li>
                        <li>
                            Нижче категорії є вікно, в яке потрібно додати опис тварини.
                        </li>
                        <li>
                            Нижче опису є вікно, куди потрібно розмістити інформацію про історію порятунку тварини.
                        </li>
                        <li>
                            Нижче історії порятунку розміщено 2 кнопки: ліворуч біла з написом Скасувати та
                            праворуч помаранчева з написом Зберегти.
                        </li>
                        <li>
                            Якщо ви заповнили всі віконця, додали хоча б одне фото та обрали категорію для
                            тварини, а також зробили це українською та англійською мовами, активується кнопка
                            Зберегти. Натиснувши цю кнопку нова картка тварини буде збережена в базу даних.
                        </li>
                        <li>
                            Новостворена та створені до того картки тварин розміщуються у списку, де видно фото,
                            ім'я, категорія, опис, історія порятунку.
                        </li>
                        <li>
                            Праворуч від колонок розміщується сортувальник за категоріями. Коли категорія не вибрана,
                            сортувальник показує, що тварини розміщені від найновійших зверху. Натискаючи на напис
                            Найновіші, до низу випадає перелік категорій, які можна обрати: коти, собаки, інші тварини.
                            Коли ви обираєте категорію, сторінка відображає лише тварин відповідної категорії.
                        </li>
                        <li>
                            На сторінці розміщується інформація про 10 тварин. Якщо у базі данних більше ніж 10 тварин,
                            то сайт створює додаткові сторінки у необхідній кількості.
                        </li>
                        <li>
                            Натискаючи на смітничок ви можете видалити картку тварини з переліку тварин
                            (видалення відбувається з бази даних та з сайту).
                        </li>
                        <li>
                            Натискаючи на олівець, ви можете редагувати(вносити зміни) у картці Тварини через вікно
                            Редагувати тварину. Можна внести зміни до будь-якої інформації,
                            що міститься у віконцях, та замінити фото.
                        </li>
                    </ol>
                </div>
            </article>
        </div>
    )
}