import styles from "../styles/helpSideBar.module.scss"

export default function PetsTab() {
    return (
        <div>
            <article>
                <div className={styles.pageTitle}>
                    <h2>Тварини</h2>
                </div>
                <div className={styles.pageContent}>
                    <ol>
                        <li>
                            У вкладці "Тварини" ви можете додавати, видаляти та вносити зміни до карток тварин,
                            що розміщуються на сайті на сторінці "Наші тварини" та, відповідно, у базі даних.
                        </li>
                        <li>
                            Щоб додати картку тварини, потрібно натиснути на кнопку "Додати тварину", що знаходиться
                            у верхньому правому кутку вкладки.
                        </li>
                        <li>
                            Після натискання кнопки "Додати тварину" поверх панелі відкривається вікно "Додати тварину".
                            Вікно має дві вкладки відповідно до мов, якими вносяться дані про тварину: українська (ліворуч)
                            та англійська (праворуч).
                            <strong> Важливо: для збереження картки інформація повинна бути внесена обома мовами.</strong>
                        </li>
                        <li>
                            Додайте ім’я тварини у строку для введення імені тварини. Мінімальна кількість символів, 
                            які треба ввести в це поле - 3. Обмеження максимальної кількості - 500 символів.
                        </li>
                        <li>
                            Додайте фото тварини, натиснувши на плюсик під строкою для введення імені тварини.
                            При натисканні відкриється файловий провідник, де можна обрати фото. Фото також можна
                            додавати перетягуванням фото на плюсик (максимальна кількість фото, які можна додати: 4 шт.,
                            максимальний розмір одного фото: 1 МБ).
                        </li>
                        <li>
                            Нижче фото розміщується вікно для вибору категорії тварини. Виберіть категорію.
                            Всього передбачено три категорії: кіт, собака, інші тварини.
                        </li>
                        <li>
                            Нижче категорії є вікно, в яке потрібно додати опис тварини. Мінімальна кількість символів, 
                            які треба ввести в це поле - 35. Обмеження максимальної кількості - 10000 символів.
                        </li>
                        <li>
                            Нижче опису є вікно, куди потрібно розмістити інформацію про історію порятунку тварини. 
                            Мінімальна кількість символів, які треба ввести в це поле - 35. Обмеження максимальної 
                            кількості - 10000 символів.
                        </li>
                        <li>
                            Нижче історії порятунку розміщено дві кнопки: ліворуч біла з написом "Скасувати" та
                            праворуч помаранчева з написом "Зберегти".
                        </li>
                        <li>
                            Якщо ви заповнили всі віконця, додали хоча б одне фото та обрали категорію для тварини,
                            а також зробили це українською та англійською мовами, активується кнопка "Зберегти".
                            Натиснувши цю кнопку, нова картка тварини буде збережена в базі даних.
                        </li>
                        <li>
                            Новостворена та раніше створені картки тварин розміщуються у списку, де видно фото,
                            ім'я, категорію, опис та історію порятунку. 
                        </li>
                        <li>
                            Праворуч від колонок розміщується сортувальник за категоріями. Коли категорія не вибрана,
                            тварини розміщені від найновіших зверху.   
                        </li>
                        <li>
                            Праворуч від сортувальника з написом "Тип тварини" розміщується галочка. Натиснувши на неї,
                            відкривається випадаюче меню з переліком категорій, які можна обрати: коти, собаки, інші тварини.
                            Коли ви обираєте категорію, сторінка відображає лише тварин відповідної категорії.
                        </li>
                        <li>
                            Натискання на сам напис "Тип тварини" призводить до того, що сортування відміняється і
                            сторінка знову відображає всіх тварин від найновіших зверху.
                        </li>
                        <li>
                            На сторінці розміщується інформація про 6 тварин. Якщо у базі даних більше ніж 6 тварин,
                            сайт створює додаткові сторінки у необхідній кількості.
                        </li>
                        <li>
                            Натискаючи на смітничок, ви можете видалити картку тварини з переліку тварин
                            (видалення відбувається з бази даних та сайту).
                        </li>
                        <li>
                            Натискаючи на олівець, ви можете редагувати (вносити зміни) у картці тварини через вікно
                            "Редагувати тварину". Можна внести зміни до будь-якої інформації, що міститься у віконцях,
                            та замінити фото.
                        </li>
                    </ol>
                </div>
            </article>
        </div>
    );
}