import styles from "../styles/helpSideBar.module.scss"

export default function StatsTab() {
    return (
        <div>
            <article>
                <div className={styles.pageTitle}>
                    <h2>Підсумки</h2>
                </div>
                <div className={styles.pageContent}>
                    <ol>
                        <li>
                            У вкладці "Підсумки" ви можете додавати, редагувати та видаляти статті.
                        </li>
                        <li>
                            Щоб створити нову статтю, вам потрібно натиснути на кнопку "Створити статтю",
                            після чого поверх панелі відкривається вікно "Додати статтю".
                            Вікно має дві вкладки відповідно до мов, на яких вноситься інформація:
                            українська (ліворуч) та англійська (праворуч).
                        </li>
                        <li>
                            Нижче назви мови є строка для введення заголовку статті.
                        </li>
                        <li>
                            Нижче розташований блок, куди додається текст статті.
                        </li>
                        <li>
                            Нижче розташований плюсик, на який власник сайту повинен натиснути,
                            щоб додати фото (при натисканні відкриється файловий провідник, де можна обрати фото).
                            Фото також можна додавати перетягуванням на плюсик
                            <em>(формат: максимальна кількість фото — 1 шт., максимальний розмір — 1 МБ).</em>
                        </li>
                        <li>
                            Нижче розміщується список статей. На сторінці відображається 6 статей.
                            Якщо у базі даних більше ніж 6 статей, сайт створює додаткові сторінки у необхідній кількості.
                        </li>
                        <li>
                            Праворуч, у кожній строчці зі статтею, знаходяться значки олівця та смітничка.
                        </li>
                        <li>
                            Щоб видалити статтю, потрібно натиснути на смітничок
                            (видалення відбувається з бази даних та сайту).
                            При натисканні з'являється віконце, яке питає, чи ви впевнені у своєму рішенні,
                            та повідомляє, що дію не можна буде скасувати.
                        </li>
                        <li>
                            Щоб редагувати статтю, вам потрібно натиснути на олівець.
                            При цьому ви потрапляєте у вікно "Редагувати статтю".
                            Тут ви можете внести зміни до будь-якої інформації, що міститься у віконцях, та замінити фото.
                        </li>
                    </ol>
                </div>
            </article>
        </div>
    );
}