import styles from "../styles/helpSideBar.module.scss"

export default function TeamTab() {
    return (
        <div>
            <article>
                <div className={styles.pageTitle}>
                    <h2>Команда</h2>
                    <h2>Далі опис користування тільки для суперадміна (суперюзера).
                        Звичайні користувачі Панелі керування можуть лише бачити перелік користувачів.
                        Жодна кнопка в цій панелі для звичайних користувачів не активна.</h2>
                </div>
                <div className={styles.pageContent}>
                    <ol>
                        <li>
                            У вкладці "Команда" суперадмін може додавати, редагувати та видаляти
                            членів команди, які мають доступ до Панелі керування.
                        </li>
                        <li>Вкладка "Команда" є другою згори в Налаштуваннях Панелі керування.</li>
                        <li>
                            Щоб додати нового члена команди, потрібно натиснути кнопку "Додати користувача",
                            після натискання якої поверх панелі відкриється вікно "Додати користувача".
                        </li>
                        <li>
                            Вікно "Додати користувача" містить строку, куди потрібно вписати
                            ім'я та прізвище нового користувача.
                        </li>
                        <li>Нижче розташована строка, куди додається номер телефону нового користувача.</li>
                        <li>
                            Нижче розташований плюсик, на який ви можете натиснути, щоб додати фото
                            (при натисканні відкривається файловий провідник, де можна обрати фото).
                            Фото також можна додавати перетягуванням фото на плюсик.
                            <br />
                            <em>(Формат: максимальна кількість фото — 1 шт., максимальний розмір — 300 КБ)</em>
                        </li>
                        <li>Додавання фото для цієї форми не є обов'язковим.</li>
                        <li>
                            Нижче місця, де додаються фото, розміщено 2 кнопки:
                            <br />
                            Ліворуч — біла з написом "Скасувати",
                            праворуч — помаранчева з написом "Зберегти".
                        </li>
                        <li>Нижче напису "Команда" розміщується список членів команди.</li>
                        <li>
                            Праворуч у кожній строчці зі статтею знаходиться значок олівця та смітничка.
                        </li>
                        <li>
                            Натискаючи на смітничок, ви можете видалити члена команди з переліку
                            (видалення відбувається з бази даних та з сайту). Суперюзер не може бути видалений.
                        </li>
                        <li>
                            Натискаючи на олівець, ви потрапляєте у вікно "Редагувати користувача".
                            Тут можна внести зміни до будь-якої інформації, що міститься у віконцях, та замінити фото.
                        </li>
                        <li>
                            Суперадмін може змінити електронну пошту натиснувши на олівець в цій вкладці або у вкладці Мій акаунт.
                        </li>
                    </ol>
                </div>
            </article>
        </div>
    );
}