{
    "pageHeroButtonText": "Історія виникнення",
    "historyOfOriginTitle": "Історія виникнення команди",
    "subtitle": "Історія виникнення",
    "historyOfOriginTextFirstPart": "Жодна державна чи комунальна установа в Україні не спеціалізується на рятуванні диких, безхатніх чи домашніх тварин, що потрапили в смертельно небезпечне становище. Тому ці завдання лягають на плечі волонтерів із необхідними навичками і спорядженням. Так, у Києві з 2014 року працює Команда порятунку тварин, або Kyiv Animal Rescue Group (KARG) — громадська організація, яка за час своєї діяльності врятувала понад 10 тисяч живих істот.",
    "historyOfOriginTextSecondPart": "У селі Плоскому, неподалік Києва, кіт потрапив до вентиляційної шахти будинку. Отримавши дзвінок від власниці тварини, екіпаж рятувальників вирушає на завдання. Троє людей, одягнені у спеціальні робочі костюми, підіймаються на горище. Спершу вони роблять два заміри: один вказує на відстань від вентиляції до торцевої стіни будівлі, а інший — висоту, де застряг кіт. Після цього вони просвердлюють перфоратором кахельну стіну ванної кімнати (до якої тварина перебуває найближче). Звідти на них позирає пара спантеличених котячих очей. Наостанок лишається небагато: відламати ще кілька сантиметрів цементу та витягнути тварину.",
    "historyOfOriginTextThirdPart": "Саме так працює KARG — структура, що починалася з особистої ініціативи двох волонтерів — Михайла Сторожука та Любови Кравчук — і перетворилася на громадську організацію, яка опікується порятунком тварин. У її розпорядженні є чотири рятувальні автомобілі та один пожежний, а сама організація нараховує понад двадцять людей. Щодня на гарячу лінію Команди порятунку надходять дзвінки: зазвичай звертаються із запитами кияни, однак телефонують також люди з передмістя. А часом навіть із інших регіонів країни. Бо сьогодні вкрай важко знайти організацію, члени якої не лише володіли б специфічними навичками порятунку тварин, а й погодилися робити це за невелику плату, а подеколи й безкоштовно.",
    "needInfoTitle": "Потрібна допомога?",
    "needInfoSubtitle": "Перш ніж звертатися до нас, обов`язково ознайомтеся з переліком послуг, які ми надаємо, і правилами звернення до нас.",
    "needInfoButtonCaption": "Правила звернення",
    "historyOfOriginButtonText": "Про команду"
}