// styles
import styles from './rules.module.scss';
// locale
import initTranslations from "@/app/i18n";
import TranslationsProvider from "@/components/TranslationsProvider";
// components
import Header from "@/components/Header/header";
import Footer from "@/components/Footer/footer";
import ScrollToTop from "@/components/common/ScrollToTop/scrollToTop";

const i18nNamespaces = ["common"];

const WebsiteRules = async ({ params: { locale } }) => {
    const { t, resources } = await initTranslations(locale, i18nNamespaces);

    return (
        <TranslationsProvider
            resources={resources}
            locale={locale}
            namespaces={i18nNamespaces}
        >
            <Header />
            <div className={styles.container}>
                <h1 className={styles.heading}>Правила користування сайтом</h1>

                <p className={styles.paragraph}>Команда використовує веб-сайт («Сайт») для надання загальної інформації
                    про діяльність компанії. Використання Вами цього сайту означає Вашу
                    згоду з цими умовами.</p>

                <h2 className={styles.subheading}>Згода з правилами користування сайту</h2>

                <p className={styles.paragraph}>Просимо приділити кілька хвилин, щоб уважно ознайомитися з цими
                    Правилами користування сайтом (далі -- Правилами). Своїм доступом до
                    Сайту і його використанням Ви погоджуєтеся дотримуватися цих Правил та
                    слідувати їм. Якщо Ви не згодні дотримуватися цих Правил і слідувати їм,
                    Ви не маєте права отримувати доступ, використовувати або завантажувати
                    матеріали з цього Сайту.</p>

                <h2 className={styles.subheading}>Можливість зміни Правил</h2>

                <p className={styles.paragraph}>Команда залишає за собою право викладати в новій редакції ці Правила в
                    будь-який час без попереднього повідомлення. Команда здійснює це шляхом
                    публікації нової редакції Правил на цьому Сайті.</p>

                <p className={styles.paragraph}>Використання Вами цього Сайту після будь-яких таких змін вважається
                    Вашою згодою дотримуватися Правил в новій редакції. Тому ми рекомендуємо
                    вивчати Правила при кожному використанні цього Сайту.</p>

                <h2 className={styles.subheading}>Політика конфіденційності</h2>

                <p className={styles.paragraph}>Команда зобов'язується дотримуватися конфіденційності персональних
                    даних користувачів цього Сайту. Політика конфіденційності, опублікована
                    на цьому сайті, є описом діючих політик і практик Команди щодо
                    персональної інформації, яка збирається Командою за допомогою цього
                    Сайту.</p>

                <p className={styles.paragraph}>Політика конфіденційності є частиною цих загальних умов. Якщо Ви
                    погоджуєтеся дотримуватися загальних умов, то Ви даєте згоду на збір,
                    використання і розкриття Вашої персональної інформації відповідно до
                    політики конфіденційності цього Сайту. Просимо приділити кілька хвилин,
                    щоб ознайомитися з нею.</p>

                <p className={styles.paragraph}>У відносинах між Вами, Вашою компанією і нами Команда має виняткове і
                    одноосібне право власності на всі права, назви і речові права щодо цього
                    Сайту, включаючи, в тому числі, дизайн, характеристики, функціонал,
                    навігацію, контент, оформлення інтерфейсу цього Сайту і всі дані, що
                    збираються за допомогою цього Сайту, включаючи, в тому числі, всі права
                    інтелектуальної власності пов'язані з ним, всі авторські права,
                    патенти, товарні знаки, комерційні таємниці і ноу-хау.</p>

                <h2 className={styles.subheading}>Право на зміну Сайту</h2>

                <p className={styles.paragraph}>Команда залишає за собою право змінювати контент і функціонал цього
                    Сайту будь-яким чином, обмежувати доступ до цього Сайту, закривати цей
                    Сайт в будь-який час і з будь-якої причини без попереднього повідомлення
                    і не несе ніякої відповідальності перед Вами або Вашою компанією щодо
                    будь-яких наслідків таких змін або закриття.</p>

                <h2 className={styles.subheading}>Повідомлення про авторське право і обмежена ліцензія</h2>

                <p className={styles.paragraph}>Вся візуальна і звукова інформація цього Сайту (тут і далі - Контент),
                    включаючи, наприклад, всі тексти, фотографії, ілюстрації, графічні
                    матеріали, аудіо, відео та аудіовідеокліпи, захищена авторським правом.</p>

                <p className={styles.paragraph}>Вам надається неексклюзивна ліцензія на Контент з урахуванням наступних
                    обмежень: Ви маєте право завантажувати, зберігати, друкувати, копіювати
                    і спільно використовувати Контент з цього Сайту за умови, що Ви:</p>

                <ol className={styles.list}>
                    <li className={styles.listItem}>(1) використовуєте Контент виключно в некомерційних цілях і для
                        розвитку Ваших партнерських відносин з Командою;</li>

                    <li className={styles.listItem}>(2) публікуєте або розміщуєте будь-які елементи Контенту на будь-якому
                        іншому інтернет-сайті або на будь-якому іншому носії в контексті,
                        аналогічному тому, в якому вона представлена на цьому Сайті;</li>

                    <li className={styles.listItem}>(3) співвідносите Контент з діяльністю Команди;</li>

                    <li className={styles.listItem}>(4) не змінюєте Контент жодним чином, а також не видаляєте і не
                        змінюєте жодні повідомлення про авторські права, товарні знаки або
                        конфіденційності.</li>
                </ol>

                <p className={styles.paragraph}>Крім випадків, коли це в прямій формі встановлено вище, Ви не маєте
                    права копіювати, завантажувати, друкувати, публікувати, демонструвати,
                    відтворювати, поширювати, передавати, транслювати, переводити,
                    модифікувати, доповнювати, актуалізувати, компілювати, скорочувати або
                    будь-яким іншим чином трансформувати або адаптувати всі або будь-які з
                    елементів Контенту цього Сайту без попередньої письмової згоди Команди.</p>

                <p className={styles.paragraph}>Крім випадків, коли це в прямій формі встановлено вище, жодні права,
                    назви або речові права на завантажений Контент не передаються Вам, коли
                    Ви завантажуєте контент з цього Сайту. За винятком обмеженої
                    неексклюзивної ліцензії, в прямій формі наданої вище, жодне положення
                    цих загальних умов і справжнього Сайту не тлумачиться як надання
                    будь-якої ліцензії або будь-якого іншого права щодо будь-яких авторських
                    прав, прав на товарні знаки, патентних прав або інших прав
                    інтелектуальної власності Команди або будь-якої третьої особи.</p>

                <h2 className={styles.subheading}>Повідомлення про права на товарні знаки</h2>

                <p className={styles.paragraph}>Усі товарні знаки, знаки обслуговування і логотипи, які демонструються
                    на цьому Сайті (тут і далі - Товарні знаки), являють собою зареєстровані
                    і незареєстровані товарні знаки Команди, однієї з її афілійованих осіб
                    або третіх сторін, які надали ліцензії на свої товарні знаки Команді або
                    одній з її афілійованих осіб.</p>

                <p className={styles.paragraph}>Крім випадків, коли це в прямій формі встановлено цими загальними
                    умовами, Ви не маєте права відтворювати, демонструвати або іншим чином
                    використовувати будь-який Товарний знак без попередньої письмової згоди
                    від Команди.</p>

                <h2 className={styles.subheading}>Добровільні пропозиції</h2>

                <p className={styles.paragraph}>Команда вітає Ваші зауваження та коментарі щодо цього Сайту. Усі факти і
                    матеріали, що надаються Командою за допомогою цього Сайту, включаючи
                    будь-які зауваження, коментарі, ідеї, питання, розробки, дані тощо, не
                    вважаються конфіденційною інформацією. З цієї причини ми просимо Вас не
                    надсилати нам жодних відомостей або матеріалів, якими Ви не маєте наміру
                    поступитися нам, включаючи, в тому числі, будь-які конфіденційні
                    відомості і будь-які оригінальні креативні матеріали.</p>

                <p className={styles.paragraph}>Направляючи кореспонденцію і/або матеріали Команді за допомогою цього
                    Сайту, Ви передаєте Команді на безоплатній основі всі глобальні права,
                    права власності та речові права, авторські права та права
                    інтелектуальної власності на інформацію та / або матеріали, які Ви
                    надсилаєте. Команда має право використовувати будь-які відомості та /
                    або матеріали, які Ви надаєте за допомогою цього Сайту, і будь-які ідеї,
                    концепції, ноу-хау або техніки в складі будь-яких таких відомостей і /
                    або матеріалів для яких би то не було цілей, включаючи, в тому числі,
                    розробку, виготовлення і збут цифрового продукту з використанням
                    відомостей або матеріалів без обмежень і без будь-яких відшкодувань на
                    Вашу користь.</p>

                <p className={styles.paragraph}>Проте Команда не використовує жодних відомостей або матеріалів, які Ви
                    надаєте за допомогою цього Сайту, якщо це порушує чинне законодавство
                    про конфіденційність. Зокрема, Команда не публікує імена або іншим чином
                    не робить надбанням громадськості факт надання Вами відомостей або
                    матеріалів нам, якщо тільки: (a) нами не було отримано Ваш дозвіл на
                    використання Вашого імені; або (b) Ви не були попередньо повідомлені
                    нами про те, що матеріали або інші відомості, що надаються Вами в
                    певному розділі цього Сайту, публікуються або іншим чином
                    використовуються з зазначенням Вашого імені в них; або (c) ми не
                    зобов'язані здійснювати це в силу дії закону.</p>

                <p className={styles.paragraph}>Ви несете відповідальність за кореспонденцію, що направляється за
                    допомогою цього Сайту, включаючи, в тому числі, відповідальність за її
                    достовірність і точність.</p>

                <p className={styles.paragraph}>Просимо звернути увагу, що надані Вами відомості (наприклад, в нашій
                    формі звернення) не мають зобов'язальної дії щодо Команди. Відповідно,
                    листи, повідомлення та інше повинні спрямовуватися виключно на адреси,
                    зазначені на відповідному сайті.</p>

                <h2 className={styles.subheading}>Сторонні відомості</h2>

                <p className={styles.paragraph}>Певні відомості, статті або інші матеріали, надані цим Сайтом, надаються
                    Команді третіми особами. У кожному разі, коли це доцільно, джерела таких
                    сторонніх матеріалів ідентифікуються. Ці сторонні матеріали надаються
                    виключно для ознайомлення і зручності. Команда не надає жодних гарантій
                    або запевнень щодо актуальності, точності, повноти або надійності таких
                    матеріалів. Команда не несе відповідальності за будь-яке використання
                    таких сторонніх відомостей.</p>

                <h2 className={styles.subheading}>Посилання на інші веб-сайти</h2>

                <p className={styles.paragraph}>Сайт містить посилання на веб-сайти, які не належать Команді. Ці
                    гіперпосилання передбачені виключно для зручності посилання і не
                    вважаються визнанням будь-якого матеріалу таких сторонніх веб-сайтів або
                    зв'язку з їх операторами. Команда не контролює зазначені веб-сайти і не
                    несе відповідальності за їх зміст. Доступ до вказаних веб-сайтів і їх
                    використання здійснюються виключно на Ваш власний ризик.</p>

                <h2 className={styles.subheading}>Відмова від гарантій</h2>

                <p className={styles.paragraph}>Цей Сайт працює на умовах як є і без запевнень або гарантій будь-якого
                    характеру. У всіх встановлених відповідним законом випадках підрозділи
                    Команди відмовляються від усіх гарантій, прямих, непрямих, законних чи
                    інших. Без обмеження сенсу попереднього положення і у всіх встановлених
                    законом випадках підрозділи Команди справжнім відмовляються від (А) всіх
                    заяв стосовно товарної придатності, придатності для певної мети, прав
                    власності та непорушення прав інтелектуальної власності щодо цього Сайту
                    і його змісту; (B) гарантій щодо затримок, перебоїв, помилок або упущень
                    в роботі цього Сайту або будь-якого його розділу; (С) гарантій щодо
                    передачі або доставки контенту цього Сайту або його доступності в
                    будь-який певний час в будь-якому певному місці; (D) гарантій щодо
                    безпеки цього Сайту або свободи Контенту цього Сайту від вірусів,
                    троянів або іншого коду з забруднюючими або деструктивними
                    властивостями; (Е) гарантій щодо використання, правдивості, точності,
                    актуальності, повноти, придатності, надійності або результатів
                    використання цього Сайту, включаючи будь-який Контент, і (F)
                    гарантій щодо веб-сайтів, на які з цього Сайту можна перейти по
                    посиланнях.</p>

                <h2 className={styles.subheading}>Обмеження відповідальності</h2>

                <p className={styles.paragraph}>Використання Вами і Вашою компанією цього Сайту, його Контенту, що
                    надаються за допомогою цього Сайту, здійснюється на Ваш власний ризик і
                    власний ризик Вашої компанії. Підрозділи Команди, а також, в тому числі
                    їх відповідні директори, посадові особи, працівники або учасники за
                    жодних обставин не несуть жодної відповідальності щодо будь-яких збитків
                    або шкоди, що виникає з або у зв'язку з доступом до, використанням або
                    нездатністю використання цього Сайту, його контенту, Вами або Вашою
                    компанією, а також щодо Вашої надії або надії Вашої компанії на будь-яку
                    інформацію, надану за допомогою справжнього сайту. Без обмеження сенсу
                    попереднього положення підрозділи Команди не несуть жодної
                    відповідальності за можливі помилки або упущення в складі контенту. Дане
                    положення є комплексним обмеженням відповідальності, що застосовується
                    до всіх яких би то не було видів збитку і шкоди, як прямих, так і
                    непрямих, а також загальних, особливих, випадкових, непрямих, штрафних
                    або інших, включаючи в тому числі припинення діяльності, втрату або
                    пошкодження даних, втрату або шкоду репутації.</p>

                <p className={styles.paragraph}>Справжнє обмеження відповідальності застосовується у всіх встановлених
                    відповідним законом випадках, незалежно від підстав відповідальності:
                    контракту, недбалості, делікту, суворої відповідальності або будь-яких
                    інших підстав, а також навіть якщо уповноважений представник будь-якого
                    з підрозділів Команди був повідомлений або повинен був бути обізнаний
                    про можливості таких збитків і без урахування дійсності інших засобів
                    захисту.</p>

                <p className={styles.paragraph}>Якщо будь-які із зазначених обмежень відповідальності визнаються
                    недійсними або нездійсненними в примусовому порядку за будь-якої
                    причини, то сукупна відповідальність підрозділів Команди при даних
                    обставинах щодо відповідальності, яка в іншому випадку була б обмежена,
                    не перевищує 100,00 (сто) гривень.</p>

                <p className={styles.paragraph}>У певних юрисдикціях заборонено встановлювати обмеження на певні
                    відшкодування шкоди, тому дані обмеження відповідальності повністю або
                    частково можуть не застосовуватися до Вас і / або Вашої компанії, а Ви і
                    / або Ваша компанія можете мати додаткові права.</p>

                <h2 className={styles.subheading}>Право, що застосовується. і юрисдикція.</h2>

                <p className={styles.paragraph}>Справжні загальні умови регулюються, підпадають під дію і тлумачаться
                    відповідно до законодавства України.</p>

                <h2 className={styles.subheading}>Автономність положень.</h2>

                <p className={styles.paragraph}>Якщо будь-яке положення цих загальних умов буде визнано судом
                    компетентної юрисдикції таким, що суперечить законодавству, то такий
                    стан підлягає зміні і тлумаченню, максимально відповідним цілям і
                    задачам початкового положення у всіх дозволених законом випадках, а інші
                    положення цих загальних умов зберігають повну юридичну силу.</p>

                <h2 className={styles.subheading}>Вичерпний характер угоди.</h2>

                <p className={styles.paragraph}>Правила являють собою вичерпну угоду між Вами, Вашою компанією і
                    Компанією щодо Вашого доступу і доступу Вашої компанії до даного Сайту
                    та / або використання Вами і Вашою компанією цього Сайту. Правила не
                    підлягають викладу в новій редакції, за винятком випадків, в прямій
                    формі передбачених цими Правилами.</p>

                <h2 className={styles.subheading}>Дата редакції</h2>

                <p className={styles.paragraph}>Правила були в останній раз викладені в новій редакції в березні 2025 р.</p>
            </div>
            <ScrollToTop />
            <Footer />
        </TranslationsProvider>
    );
};

export default WebsiteRules;